Процедура ЗаписатьПрисоединенныйФайлВБазу(ПараметрыФайла,АдресФайлаВоВременномХранилище,Форма, ПутьКДанным,Предмет=Неопределено) Экспорт
//	ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь());

//	ПрисоединенныйФайл=РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресФайлаВоВременномХранилище);
//	
//	Если Не Предмет=Неопределено Тогда
//		УправлениеЗадачами.УстановитьПредметПрисоединенногоФайла(ПрисоединенныйФайл,Предмет);
//	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПрисоединенныеФайлыКОбъекту(ПрисоединенныеФайлы, ВладелецФайлов,Форма, ПутьКДанным) Экспорт
//	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ВладелецФайлов, ПрисоединенныеФайлы);
КонецПроцедуры

Процедура ПриПолученииДанныхФайла(ДанныеФайла, ПрисоединенныйФайл, ИдентификаторФормы,Форма, ВладелецФайлов, ПутьКДанным)  Экспорт
//	ДополнительныеПараметры = Новый Структура("ИдентификаторФормы", ИдентификаторФормы);
//
//	ДанныеФайла = РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл, ДополнительныеПараметры);
КонецПроцедуры

