&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстСинтаксиса=
	"# Краткий синтаксис markdown
	|
	|## Шрифты
	|| Синтаксис | Результат |
	|| ------ | ------ |
	|| `**Жирный**` | **Жирный** |
	|| `*Курсив*` | *Курсив* |
	|| `***Жирный курсив***` | ***Жирный урсив*** |
	|
	|## Списки
	|### Нумерованный список
	|``` 
	|1. Раз
	|1. Два 
	|1. Три
	|```
	|1. Раз
	|1. Два 
	|1. Три
	|
	|### Ненумерованный список
	|``` 
	|* Раз
	|* Два 
	|* Три
	|```
	|* Раз
	|* Два 
	|* Три
	|
	|## Списки задач
	|
	|```
	|- [x] выполненная задача
 	|- [ ] невыполнено
	|
	|```
	|- [x] выполненная задача
 	|- [ ] невыполнено
	|
	|
	|## Заголовки
	|
	|`# Заголовок 1` 
	|# Заголовок 1
	|
	|`## Заголовок 2` 
	|## Заголовок 2
	|
	|`### Заголовок 3` 
	|### Заголовок 3
	|
	|## Ссылки
	|| Синтаксис | Результат |
	|| ------ | ------ |
	|| `http://foo.bar` | http://foo.bar |
	|| `[Foo](http://foo.bar)` | [Foo](http://foo.bar) |
	|| `example@example.com` | example@example.com |
	|
	|## Встроенные картинки
	|`![](urlКртинки)`
	|`![](ИмяПрисоединенногоФайла)`
	|
	|## Цитаты(вложенные блоки)
	|
	|```
	|> Цитата 1 го уровная
	|> > Цитата 2-го уровня
	|> > > Цитата 3-го уровня
	|```
	|> Цитата 1 го уровная
	|> > Цитата 2-го уровня
	|> > > Цитата 3-го уровня
	|
	|
	|## Таблица
	|```
	|| А | Б | В |
	|| ------ | ------ | ------ |
	|| А | Б | В |
	|| А | Б | В |
	|| А | Б | В |
	|
	|```
	|| А | Б | В |
	|| ------ | ------ | ------ |
	|| А | Б | В |
	|| А | Б | В |
	|| А | Б | В |
	|
	|## Блоки кода
	|
	|Пример
	|
	|	```
	|	//@skip-warning
	|	&НаКлиенте
	|	Процедура РМ_Подключаемый_ПриНажатииПоляПросмотраКомментария(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	|		РМ_MarkdownКлиент.ПриНажатииПоляПросмотраКомментария(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
	|	КонецПроцедуры
	|
	|	```
	|
	|Результат
	|```
	|//@skip-warning
	|&НаКлиенте
	|Процедура РМ_Подключаемый_ПриНажатииПоляПросмотраКомментария(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	|	РМ_MarkdownКлиент.ПриНажатииПоляПросмотраКомментария(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
	|КонецПроцедуры
	|
	|```
	|
	|[Полный синтаксис редактора](https://github.com/showdownjs/showdown/wiki/Showdown's-Markdown-syntax)
	|[Markdown синтаксис на русском](https://github.com/LevkinSergey/markdown-doc)
	|";

	
	РМ_MarkdownСервер.ВставитьПолеРедактированияТекстаНаФорму(ЭтаФорма, Элементы.ГруппаКраткийСинтаксис,
		"ТекстСинтаксиса",,Истина);
КонецПроцедуры

#Область Просмотр

//@skip-warning
&НаКлиенте
Процедура РМ_Подключаемый_ПриНажатииПоляПросмотраКомментария(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	РМ_MarkdownКлиент.ПриНажатииПоляПросмотраКомментария(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура РМ_Подключаемый_ДокументСформированПоляПросмотраКомментария(Элемент)
	РМ_MarkdownКлиент.ДокументСформированПоляПросмотраКомментария(ЭтаФорма, Элемент);
КонецПроцедуры

#КонецОбласти
