Функция ПолучитьАдресКомпонентыShowodwn() Экспорт
	ДвоичныеДанные=ПолучитьОбщийМакет("showdown");
	
	ИмяВременногоФайла=ПолучитьИмяВременногоФайла("js");
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	Текст=Новый ТекстовыйДокумент;
	Текст.Прочитать(ИмяВременногоФайла);
	
	ПутьКБиблиотеке=ПоместитьВоВременноеХранилище(Текст.ПолучитьТекст());
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
	КонецПопытки;
	
	Возврат ПутьКБиблиотеке;
КонецФункции

Функция ПолучитьТекстКомпонентыFontAvesome() Экспорт
	Возврат ПолучитьОбщийМакет("CSS_FontAwesome").ПолучитьТекст();
КонецФункции