Функция ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным) Экспорт
	Возврат СтрЗаменить(ПутьКДанным,".","_");
КонецФункции

Функция ПолучитьПутьКДаннымИЗПутиБезЛишнего(ПутьКДаннымБезЛишнего) Экспорт
	Возврат СтрЗаменить(ПутьКДаннымБезЛишнего,"_",".");
КонецФункции

Функция ПолучитьИмяЭлементаПанелиСтраницРедактированияКомментария(ПутьКДанным) Экспорт 
	Возврат "Страницы_"+ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
КонецФункции

Функция ПолучитьИмяСтраницыРедактированияКомментария(ПутьКДанным) Экспорт
	Возврат "Страница_Редактирование_"+ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);	
КонецФункции

Функция ПолучитьИмяСтраницыПросмотраКомментария(ПутьКДанным) Экспорт
	Возврат "Страница_Просмотр_"+ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);	
КонецФункции

Функция ПолучитьИмяЭлементаРедактированияКомментария(ПутьКДанным) Экспорт
	Возврат ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
КонецФункции

Функция ПолучитьИмяЭлементаПросмотраКомментария(ПутьКДанным) Экспорт
	Возврат "ПолеПросмотра_"+ПолучитьПутьКДаннымБезЛишнего(ПутьКДанным);
КонецФункции

Функция ПолучитьПутьКДаннымПоИменаПанелиСтраниц(ИмяПанели) Экспорт
	ПутьКДаннымБезЛишнего=СтрЗаменить(ИмяПанели,"Страницы_","");
	Возврат ПолучитьПутьКДаннымИЗПутиБезЛишнего(ПутьКДаннымБезЛишнего);
КонецФункции

Процедура СконвертироватьИмяПрисоединенногоФайлаВТексте(Текст,ИмяФайла,Адрес) Экспорт
	СтрокаПоиска = СтрШаблон("![](%1)", ИмяФайла);
	СтрокаЗамены = СтрШаблон("![](%1)", Адрес);
	
	Текст = СтрЗаменить(Текст, СтрокаПоиска, СтрокаЗамены);
КонецПроцедуры

Процедура СконвертироватьИменаПрисоединенныхФайловВТексте(ДанныеПрисоединенныхФайлов, Текст) Экспорт
	
	Для Каждого ДанныеФайла Из ДанныеПрисоединенныхФайлов Цикл
		
		СконвертироватьИмяПрисоединенногоФайлаВТексте(Текст,ДанныеФайла.ИмяФайла,ДанныеФайла.Адрес);
		
	КонецЦикла;
	
КонецПроцедуры
