
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВариантыПодсветки=РМ_MarkdownСервер.ВариантыПодсветкиСинтаксиса();
	Элементы.ВариантПодсветки.СписокВыбора.Очистить();
	
	Для Каждого Вариант ИЗ ВариантыПодсветки Цикл
		Элементы.ВариантПодсветки.СписокВыбора.Добавить(Вариант);
	КонецЦикла;
	
	ВариантПодсветкиСинтаксиса="vs";
	
	РМ_MarkdownСервер.ВставитьПолеРедактированияТекстаНаФорму(ЭтаФорма,Элементы.ГруппаТекстРедактирования,"ТекстРедактирования",ВариантПодсветкиСинтаксиса);
КонецПроцедуры

&НаКлиенте
Процедура ВариантПодсветкиПриИзменении(Элемент)
	ПутьКПолюПросмотра=РМ_MarkdownКлиентСервер.ПолучитьИмяЭлементаПросмотраКомментария("ТекстРедактирования");
	ЭтотОбъект[ПутьКПолюПросмотра]=РМ_MarkdownСервер.СформироватьТекстHTMLДляТекстаMarkdown(ВариантПодсветкиСинтаксиса);
КонецПроцедуры




#Область ПодключаемыеКоманды

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ПриСменеСтраницыПоляКомментария(Элемент, ТекущаяСтраница)
	РМ_MarkdownКлиент.ПриСменеСтраницыПоляКомментария(ЭтаФорма,Элемент, ТекущаяСтраница);	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыПоляКомментария(Команда)
	РМ_MarkdownКлиент.ОбработкаКомандыПоляКомментария(ЭтаФорма,Команда);	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ПриНажатииПоляПросмотраКомментария(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	РМ_MarkdownКлиент.ПриНажатииПоляПросмотраКомментария(ЭтаФорма,Элемент, ДанныеСобытия, СтандартнаяОбработка);	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныйФайл(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	РМ_MarkdownКлиент.ОткрытьПрисоединенныйФайл(ЭтаФорма,Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриДобавленииПрисоединенногоФайла(ИмяФайла, ИдентификаторФайла) Экспорт
	РМ_MarkdownСервер.ВывестиЭлементыПрисоединенногоФайлаНаФорму(ЭтотОбъект, ИмяФайла, ИдентификаторФайла, "Объект.Содержание");
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_УдалитьНовыйПрисоединенныйФайл(Команда)
	ИдентификаторСтроки = Число(СтрЗаменить(Команда.Имя, "УдалитьНовыйПрисоединенныйФайл", ""));
	РМ_MarkdownКлиент.УдалитьНовыйПрисоединенныйФайл(ЭтаФорма,ИдентификаторСтроки);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОткрытьНовыйПрисоединенныйФайл(Команда)
	ИдентификаторСтроки = Число(СтрЗаменить(Команда.Имя, "ОткрытьНовыйПрисоединенныйФайл", ""));
	РМ_MarkdownКлиент.ОткрытьПрисоединенныйФайл(ЭтаФорма,ИдентификаторСтроки);
КонецПроцедуры

#КонецОбласти

