&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВариантыПодсветки=РМ_MarkdownСервер.ВариантыПодсветкиСинтаксиса();
	Элементы.ВариантПодсветки.СписокВыбора.Очистить();

	Для Каждого Вариант Из ВариантыПодсветки Цикл
		Элементы.ВариантПодсветки.СписокВыбора.Добавить(Вариант);
	КонецЦикла;

	ВариантПодсветкиСинтаксиса="vs";

	РМ_MarkdownСервер.ВставитьПолеРедактированияТекстаНаФорму(ЭтаФорма, Элементы.ГруппаТекстРедактирования,
		"ТекстРедактирования", ВариантПодсветкиСинтаксиса);
	РМ_MarkdownСервер.ВставитьПолеРедактированияТекстаНаФорму(ЭтаФорма, Элементы.ГруппаВторойРедакторНаФорме,
		"Объект.ТекстМД", ВариантПодсветкиСинтаксиса);
КонецПроцедуры

&НаКлиенте
Процедура ВариантПодсветкиПриИзменении(Элемент)
	ПутьКПолюПросмотра=РМ_MarkdownКлиентСервер.ПолучитьИмяЭлементаПросмотраКомментария("ТекстРедактирования");
	ЭтотОбъект[ПутьКПолюПросмотра]=РМ_MarkdownСервер.СформироватьТекстHTMLДляТекстаMarkdown(ВариантПодсветкиСинтаксиса);
	
	ПутьКПолюПросмотра=РМ_MarkdownКлиентСервер.ПолучитьИмяЭлементаПросмотраКомментария("Объект.ТекстМД");
	ЭтотОбъект[ПутьКПолюПросмотра]=РМ_MarkdownСервер.СформироватьТекстHTMLДляТекстаMarkdown(ВариантПодсветкиСинтаксиса);
КонецПроцедуры




#Область ПодключаемыеКоманды

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ПриСменеСтраницыПоляКомментария(Элемент, ТекущаяСтраница)
	РМ_MarkdownКлиент.ПриСменеСтраницыПоляКомментария(ЭтаФорма, Элемент, ТекущаяСтраница);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыПоляКомментария(Команда)
	РМ_MarkdownКлиент.ОбработкаКомандыПоляКомментария(ЭтаФорма, Команда);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ПриНажатииПоляПросмотраКомментария(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	РМ_MarkdownКлиент.ПриНажатииПоляПросмотраКомментария(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныйФайл(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	РМ_MarkdownКлиент.ОткрытьПрисоединенныйФайл(ЭтаФорма,Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриДобавленииПрисоединенногоФайла(ИмяФайла, ИдентификаторФайла, ПутьКДаннымБезЛишнего) Экспорт
	Подключаемый_ПриДобавленииПрисоединенногоФайлаНаСервере(ИмяФайла, ИдентификаторФайла, ПутьКДаннымБезЛишнего);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ПриДобавленииПрисоединенногоФайлаНаСервере(ИмяФайла, ИдентификаторФайла, ПутьКДаннымБезЛишнего) Экспорт
	РМ_MarkdownСервер.ВывестиЭлементыПрисоединенногоФайлаНаФорму(ЭтотОбъект, ИмяФайла, ИдентификаторФайла,
		ПутьКДаннымБезЛишнего);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_УдалитьНовыйПрисоединенныйФайл(Команда)
	МассивНаименования=СтрРазделить(Команда.Имя, "_");
	ИдентификаторСтроки = Число(МассивНаименования[1]);

	МассивНаименования.Удалить(0);
	МассивНаименования.Удалить(0);

	РМ_MarkdownКлиент.УдалитьНовыйПрисоединенныйФайл(ЭтаФорма, ИдентификаторСтроки, СтрСоединить(МассивНаименования,
		"_"));
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОткрытьНовыйПрисоединенныйФайл(Команда)
	МассивНаименования=СтрРазделить(Команда.Имя, "_");
	ИдентификаторСтроки = Число(МассивНаименования[1]);

	МассивНаименования.Удалить(0);
	МассивНаименования.Удалить(0);

	РМ_MarkdownКлиент.ОткрытьПрисоединенныйФайл(ЭтаФорма, ИдентификаторСтроки, СтрСоединить(МассивНаименования, "_"));
КонецПроцедуры

#КонецОбласти